app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','NC-17','R'))  ORDER BY release_date
---
    def index
      @movies = Movie.order(sort_column)